# Exploratory Data Analysis (EDA) Coursebook

---
Welcome to Exploratory Data Analysis course!

Instructor : **Yosia Azarya**

Course length : 12 hours


The coursebook focuses on:
- Why and What: Exploratory Data Analysis
- Date Time objects
- Categorical data types
- Cross Tabulation and Pivot Table
- Treating Duplicates and Missing Values
---

## Introduction

Exploratory Data Analysis (EDA) is a method to help us understand our data. EDA plays an important part in Data Analysis before taking the next steps like data modeling.

Exploratory Data Analysis (EDA) adalah suatu metode yang digunakan untuk membantu kita dalam memahami data yang kita miliki. EDA memiliki peranan penting dalam analisis data sebelum menjalankan langkah-langkah selanjutnya seperti modeling data.

In the previous course, we've already knew about a few common techniques:
- `.head()` and `.tail()`
- `.describe()`
- `.shape` and `.size`
- `.axes`
- `.dtypes`

In the following chapter, we'll learn about another common EDA techniques such as:
- Data type conversion
- Cross-Tables and Aggregates
- Using `aggfunc` for aggregate functions
- Pivot Tables

In [1]:
#import pandas 

import pandas as pd
print(pd.__version__)

1.2.4

## Data Preparation

In [2]:
# read household.csv data and store into household, and show 5 top rows

household = pd.read_csv('data_input/household.csv')
household.head()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
0,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07
1,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.0,0,1,2018-07
2,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,64000.0,0,3,2018-07
3,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
4,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.0,0,1,2018-07

In [3]:
household.sort_values(by='unit_price',ascending=False)

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1042,10368635,34701814,8/20/2018 15:47,Rice,Rice,minimarket,219400.0,0,1,2018-08
616,9298444,31416662,7/8/2018 18:24,Rice,Rice,minimarket,219000.0,0,1,2018-07
5456,6872714,20704548,3/5/2018 21:06,Rice,Rice,supermarket,219000.0,0,1,2018-03
10487,5454646,16546365,11/19/2017 21:05,Rice,Rice,minimarket,219000.0,0,1,2017-11
1433,10425860,35076424,8/24/2018 17:30,Rice,Rice,supermarket,218900.0,0,1,2018-08
...,...,...,...,...,...,...,...,...,...,...
32653,7920737,25228688,4/24/2018 20:29,Fabric Care,Detergent,supermarket,2515.0,0,1,2018-04
31269,7692082,23425457,4/13/2018 17:27,Fabric Care,Detergent,supermarket,2515.0,0,1,2018-04
12871,9715089,32628690,7/27/2018 11:21,Fabric Care,Detergent,supermarket,2510.0,0,1,2018-07
24555,6663979,20132007,2/19/2018 15:30,Fabric Care,Detergent,supermarket,2510.0,0,1,2018-02
18501,11066785,36905342,9/16/2018 18:18,Fabric Care,Detergent,minimarket,2505.0,0,4,2018-09

Let's check the data!
- Class object of `household`
- Data dimension
- Columns name
- Missing value for each columns
- Columns' data type
- Memory's usage

In [4]:
type(household)

pandas.core.frame.DataFrame

In [ ]:
type(household['category'])

In [6]:
type(household['receipt_id'])

pandas.core.series.Series

In [7]:
# data type of household
household.dtypes

receipt_id            int64
receipts_item_id      int64
purchase_time        object
category             object
sub_category         object
format               object
unit_price          float64
discount              int64
quantity              int64
yearmonth            object
dtype: object

In [8]:
# data dimension
# put the answer code here
print(household.shape)
print(household.size)

(72000, 10)
720000

In [9]:
# columns' name
# put the answer code here
print(household.columns)

Index(['receipt_id', 'receipts_item_id', 'purchase_time', 'category',
       'sub_category', 'format', 'unit_price', 'discount', 'quantity',
       'yearmonth'],
      dtype='object')

In [10]:
household.axes[1]

Index(['receipt_id', 'receipts_item_id', 'purchase_time', 'category',
       'sub_category', 'format', 'unit_price', 'discount', 'quantity',
       'yearmonth'],
      dtype='object')

In [11]:
# Columns' data type
# put the answer code here
household.dtypes

receipt_id            int64
receipts_item_id      int64
purchase_time        object
category             object
sub_category         object
format               object
unit_price          float64
discount              int64
quantity              int64
yearmonth            object
dtype: object

In [12]:
# Missing value for each column, columns' data type, and memory usage
household.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72000 entries, 0 to 71999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   receipt_id        72000 non-null  int64
 1   receipts_item_id  72000 non-null  int64
 2   purchase_time     72000 non-null  object
 3   category          72000 non-null  object
 4   sub_category      72000 non-null  object
 5   format            72000 non-null  object
 6   unit_price        72000 non-null  float64
 7   discount          72000 non-null  int64
 8   quantity          72000 non-null  int64
 9   yearmonth         72000 non-null  object
dtypes: float64(1), int64(4), object(5)
memory usage: 5.5+ MB

## Working with date-time

In [13]:
household.head()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
0,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07
1,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.0,0,1,2018-07
2,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,64000.0,0,3,2018-07
3,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
4,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.0,0,1,2018-07

Take a look at the data. `purchase_time` column supposed to be a date-time data but stored as object instead.

Ways to change the data type to date-time:
- `parse_dates` parameter in `read_csv()` 
- `astype(datetime64)`
- `to_datetime`

### Using `parse_date` parameter in `read_csv`

In [14]:
# read household.csv and add parse_date parameter with purchase_time column as the value
household_2 = pd.read_csv('data_input/household.csv',parse_dates=['purchase_time'])
household_2.head()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
0,9622257,32369294,2018-07-22 21:19:00,Rice,Rice,supermarket,128000.0,0,1,2018-07
1,9446359,31885876,2018-07-15 16:17:00,Rice,Rice,minimarket,102750.0,0,1,2018-07
2,9470290,31930241,2018-07-15 12:12:00,Rice,Rice,supermarket,64000.0,0,3,2018-07
3,9643416,32418582,2018-07-24 08:27:00,Rice,Rice,minimarket,65000.0,0,1,2018-07
4,9692093,32561236,2018-07-26 11:28:00,Rice,Rice,supermarket,124500.0,0,1,2018-07

In [15]:
# check the data type
# put the answer code here
household_2.dtypes

receipt_id                   int64
receipts_item_id             int64
purchase_time       datetime64[ns]
category                    object
sub_category                object
format                      object
unit_price                 float64
discount                     int64
quantity                     int64
yearmonth                   object
dtype: object

### using `astype(datetime64)`

In [16]:
# copy household df into new df
household_3 = household.copy()
household_3.head()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
0,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07
1,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.0,0,1,2018-07
2,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,64000.0,0,3,2018-07
3,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
4,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.0,0,1,2018-07

In [17]:
household_3.dtypes

receipt_id            int64
receipts_item_id      int64
purchase_time        object
category             object
sub_category         object
format               object
unit_price          float64
discount              int64
quantity              int64
yearmonth            object
dtype: object

In [18]:
household_3['purchase_time'].astype('datetime64')

0       2018-07-22 21:19:00
1       2018-07-15 16:17:00
2       2018-07-15 12:12:00
3       2018-07-24 08:27:00
4       2018-07-26 11:28:00
                ...
71995   2017-12-27 09:20:00
71996   2017-12-13 19:52:00
71997   2017-12-27 08:03:00
71998   2017-12-07 12:29:00
71999   2017-12-19 18:59:00
Name: purchase_time, Length: 72000, dtype: datetime64[ns]

In [19]:
# convert the data type with astype()
household_3['purchase_time'] = household_3['purchase_time'].astype('datetime64')

In [20]:
# check the data type
household_3.dtypes

receipt_id                   int64
receipts_item_id             int64
purchase_time       datetime64[ns]
category                    object
sub_category                object
format                      object
unit_price                 float64
discount                     int64
quantity                     int64
yearmonth                   object
dtype: object

### using `to_datetime()`

In [21]:
# copy household df into new df
household_4 = household.copy()
household_4.head()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
0,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07
1,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.0,0,1,2018-07
2,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,64000.0,0,3,2018-07
3,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
4,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.0,0,1,2018-07

In [22]:
household_4.dtypes

receipt_id            int64
receipts_item_id      int64
purchase_time        object
category             object
sub_category         object
format               object
unit_price          float64
discount              int64
quantity              int64
yearmonth            object
dtype: object

In [23]:
pd.to_datetime(household_4['purchase_time'])

0       2018-07-22 21:19:00
1       2018-07-15 16:17:00
2       2018-07-15 12:12:00
3       2018-07-24 08:27:00
4       2018-07-26 11:28:00
                ...
71995   2017-12-27 09:20:00
71996   2017-12-13 19:52:00
71997   2017-12-27 08:03:00
71998   2017-12-07 12:29:00
71999   2017-12-19 18:59:00
Name: purchase_time, Length: 72000, dtype: datetime64[ns]

In [24]:
# convert the data type with to_datetime
household_4['purchase_time'] = pd.to_datetime(household_4['purchase_time'])

In [25]:
# check the data type
household_4.dtypes

receipt_id                   int64
receipts_item_id             int64
purchase_time       datetime64[ns]
category                    object
sub_category                object
format                      object
unit_price                 float64
discount                     int64
quantity                     int64
yearmonth                   object
dtype: object

### What is the difference between using `astype(datetime64)` and `to_datetime` ?

In [26]:
date = pd.Series(['30-01-2020', '31-01-2020', '01-02-2020','02-02-2020','28-02-2021'])
date

0    30-01-2020
1    31-01-2020
2    01-02-2020
3    02-02-2020
4    28-02-2021
dtype: object

using `astype(datetime64)`

In [27]:
date.astype('datetime64')

0   2020-01-30
1   2020-01-31
2   2020-01-02
3   2020-02-02
4   2021-02-28
dtype: datetime64[ns]

using  `to_datetime()`

In [28]:
pd.to_datetime(date)

0   2020-01-30
1   2020-01-31
2   2020-01-02
3   2020-02-02
4   2021-02-28
dtype: datetime64[ns]

In [29]:
# with dayfirst parameter
pd.to_datetime(date, dayfirst=True)

0   2020-01-30
1   2020-01-31
2   2020-02-01
3   2020-02-02
4   2021-02-28
dtype: datetime64[ns]

In [30]:
# with format parameter
pd.to_datetime(date, format='%d-%m-%Y')

0   2020-01-30
1   2020-01-31
2   2020-02-01
3   2020-02-02
4   2021-02-28
dtype: datetime64[ns]

### `strftime()`

We can change the format of datetime data to string with strftime(stringfortime). The full list of directives can be found in this [Documentation](https://strftime.org/).

In [31]:
tanggal = pd.to_datetime(date, dayfirst=True)
tanggal

0   2020-01-30
1   2020-01-31
2   2020-02-01
3   2020-02-02
4   2021-02-28
dtype: datetime64[ns]

In [32]:
tanggal.dt.strftime('%d-%B-%Y %A')

0     30-January-2020 Thursday
1       31-January-2020 Friday
2    01-February-2020 Saturday
3      02-February-2020 Sunday
4      28-February-2021 Sunday
dtype: object

In [33]:
tanggal.dt.strftime('%d/%B/%Y-%A')

0     30/January/2020-Thursday
1       31/January/2020-Friday
2    01/February/2020-Saturday
3      02/February/2020-Sunday
4      28/February/2021-Sunday
dtype: object

### Object date-time partition

After we convert the data into `date-time` object, we can part the data into its specific component such as year, month, day, etc.

**Date component (numeric)**
- `.dt.year` 
- `.dt.month` 
- `.dt.day`
- `.dt.dayofweek`

**Date component (string)**
- `.dt.month_name()`
- `.dt.day_name()`

You can check the full documentation here [Doc](https://pandas.pydata.org/pandas-docs/stable/reference/series.html#datetimelike-properties)

In [34]:
# change `purchase_time` column data to datetime
household['purchase_time'] = pd.to_datetime(household['purchase_time'])

Date component (numeric)

In [35]:
# .dt.year
household['purchase_time'].dt.year

0        2018
1        2018
2        2018
3        2018
4        2018
         ...
71995    2017
71996    2017
71997    2017
71998    2017
71999    2017
Name: purchase_time, Length: 72000, dtype: int64

In [36]:
# .dt.month
# put the code here
household['purchase_time'].dt.month

0         7
1         7
2         7
3         7
4         7
         ..
71995    12
71996    12
71997    12
71998    12
71999    12
Name: purchase_time, Length: 72000, dtype: int64

In [37]:
# .dt.day
# put the code here
household['purchase_time'].dt.day

0        22
1        15
2        15
3        24
4        26
         ..
71995    27
71996    13
71997    27
71998     7
71999    19
Name: purchase_time, Length: 72000, dtype: int64

In [38]:
# .dt.dayofweek
# put the code here
household['purchase_time'].dt.dayofweek

0        6
1        6
2        6
3        1
4        3
        ..
71995    2
71996    2
71997    2
71998    3
71999    1
Name: purchase_time, Length: 72000, dtype: int64

Date component (string)

In [39]:
# dt.month_name()
# put the code here
household['purchase_time'].dt.month_name()

0            July
1            July
2            July
3            July
4            July
           ...
71995    December
71996    December
71997    December
71998    December
71999    December
Name: purchase_time, Length: 72000, dtype: object

In [40]:
household['purchase_time'].dt.isocalendar().week

0        29
1        28
2        28
3        30
4        30
         ..
71995    52
71996    50
71997    52
71998    49
71999    51
Name: week, Length: 72000, dtype: UInt32

In [41]:
# dt.day_name()
# put the code here
household['purchase_time'].dt.day_name()

0           Sunday
1           Sunday
2           Sunday
3          Tuesday
4         Thursday
           ...
71995    Wednesday
71996    Wednesday
71997    Wednesday
71998     Thursday
71999      Tuesday
Name: purchase_time, Length: 72000, dtype: object

There are also other functions that can be helpful in certain situations. Supposed we want to transform the existing `datetime` column into values of periods we can use the `.to_period` method:

- `household['purchase_time'].dt.to_period('D')`
- `household['purchase_time'].dt.to_period('W')`
- `household['purchase_time'].dt.to_period('M')`
- `household['purchase_time'].dt.to_period('Q')`

In [42]:
# try .dt.to_period('D')
household['purchase_time'].dt.to_period('D')

0        2018-07-22
1        2018-07-15
2        2018-07-15
3        2018-07-24
4        2018-07-26
            ...
71995    2017-12-27
71996    2017-12-13
71997    2017-12-27
71998    2017-12-07
71999    2017-12-19
Name: purchase_time, Length: 72000, dtype: period[D]

In [43]:
# try .dt.to_period('W')
# put the code here
household['purchase_time'].dt.to_period('W-MON')

0        2018-07-17/2018-07-23
1        2018-07-10/2018-07-16
2        2018-07-10/2018-07-16
3        2018-07-24/2018-07-30
4        2018-07-24/2018-07-30
                 ...
71995    2017-12-26/2018-01-01
71996    2017-12-12/2017-12-18
71997    2017-12-26/2018-01-01
71998    2017-12-05/2017-12-11
71999    2017-12-19/2017-12-25
Name: purchase_time, Length: 72000, dtype: period[W-MON]

In [44]:
# try .dt.to_period('M')
# put the code here
household['purchase_time'].dt.to_period('M')

0        2018-07
1        2018-07
2        2018-07
3        2018-07
4        2018-07
          ...
71995    2017-12
71996    2017-12
71997    2017-12
71998    2017-12
71999    2017-12
Name: purchase_time, Length: 72000, dtype: period[M]

In [45]:
# try .dt.to_period('Q')
# put the code here
household['purchase_time'].dt.to_period('Q')

0        2018Q3
1        2018Q3
2        2018Q3
3        2018Q3
4        2018Q3
          ...
71995    2017Q4
71996    2017Q4
71997    2017Q4
71998    2017Q4
71999    2017Q4
Name: purchase_time, Length: 72000, dtype: period[Q-DEC]

### **Knowledge Check:** Date time types  
_Est. Time required: 20 minutes_

1. In the following cell, start again by reading in the `household.csv` dataset.  
2. Make sure the `purchase_time` column has converted as a datetime object.
3. Use `x.dt.weekday_name`/`x.dt.day_name()`, assuming `x` is a datetime object to get the day of week. Assign this to a new column in your `household` Data Frame, name it `weekday`
4. The `yearmonth` column stores the information of year and month of the `purchase_time`. Using `dt.to_period()`, how will you recreate the column if you needed the same information?
5. Print the first 5 rows of your data to verify that your preprocessing steps are correct

In [46]:
# put the answer code here
household_5=household.copy()
household_5.head()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
0,9622257,32369294,2018-07-22 21:19:00,Rice,Rice,supermarket,128000.0,0,1,2018-07
1,9446359,31885876,2018-07-15 16:17:00,Rice,Rice,minimarket,102750.0,0,1,2018-07
2,9470290,31930241,2018-07-15 12:12:00,Rice,Rice,supermarket,64000.0,0,3,2018-07
3,9643416,32418582,2018-07-24 08:27:00,Rice,Rice,minimarket,65000.0,0,1,2018-07
4,9692093,32561236,2018-07-26 11:28:00,Rice,Rice,supermarket,124500.0,0,1,2018-07

In [47]:
household_5.dtypes

receipt_id                   int64
receipts_item_id             int64
purchase_time       datetime64[ns]
category                    object
sub_category                object
format                      object
unit_price                 float64
discount                     int64
quantity                     int64
yearmonth                   object
dtype: object

In [48]:
household_5['day_name']=household_5['purchase_time'].dt.day_name()
household_5.head()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth,day_name
0,9622257,32369294,2018-07-22 21:19:00,Rice,Rice,supermarket,128000.0,0,1,2018-07,Sunday
1,9446359,31885876,2018-07-15 16:17:00,Rice,Rice,minimarket,102750.0,0,1,2018-07,Sunday
2,9470290,31930241,2018-07-15 12:12:00,Rice,Rice,supermarket,64000.0,0,3,2018-07,Sunday
3,9643416,32418582,2018-07-24 08:27:00,Rice,Rice,minimarket,65000.0,0,1,2018-07,Tuesday
4,9692093,32561236,2018-07-26 11:28:00,Rice,Rice,supermarket,124500.0,0,1,2018-07,Thursday

In [49]:
household_5['yearmonth']=household_5['purchase_time'].dt.to_period('M')
household_5.head()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth,day_name
0,9622257,32369294,2018-07-22 21:19:00,Rice,Rice,supermarket,128000.0,0,1,2018-07,Sunday
1,9446359,31885876,2018-07-15 16:17:00,Rice,Rice,minimarket,102750.0,0,1,2018-07,Sunday
2,9470290,31930241,2018-07-15 12:12:00,Rice,Rice,supermarket,64000.0,0,3,2018-07,Sunday
3,9643416,32418582,2018-07-24 08:27:00,Rice,Rice,minimarket,65000.0,0,1,2018-07,Tuesday
4,9692093,32561236,2018-07-26 11:28:00,Rice,Rice,supermarket,124500.0,0,1,2018-07,Thursday

Tips: In the cell above, start from:

`household = pd.read_csv("data_input/household.csv")`

Inspect the first 5 rows of your data and pay close attention to the `weekday` column.

## Working with Categorical Data

Open data types for every columns in `household` data

In [50]:
household['weekday']=household['purchase_time'].dt.day_name()
household.head()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth,weekday
0,9622257,32369294,2018-07-22 21:19:00,Rice,Rice,supermarket,128000.0,0,1,2018-07,Sunday
1,9446359,31885876,2018-07-15 16:17:00,Rice,Rice,minimarket,102750.0,0,1,2018-07,Sunday
2,9470290,31930241,2018-07-15 12:12:00,Rice,Rice,supermarket,64000.0,0,3,2018-07,Sunday
3,9643416,32418582,2018-07-24 08:27:00,Rice,Rice,minimarket,65000.0,0,1,2018-07,Tuesday
4,9692093,32561236,2018-07-26 11:28:00,Rice,Rice,supermarket,124500.0,0,1,2018-07,Thursday

In [51]:
# put the answer code here
household.dtypes

receipt_id                   int64
receipts_item_id             int64
purchase_time       datetime64[ns]
category                    object
sub_category                object
format                      object
unit_price                 float64
discount                     int64
quantity                     int64
yearmonth                   object
weekday                     object
dtype: object

In [52]:
household.head()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth,weekday
0,9622257,32369294,2018-07-22 21:19:00,Rice,Rice,supermarket,128000.0,0,1,2018-07,Sunday
1,9446359,31885876,2018-07-15 16:17:00,Rice,Rice,minimarket,102750.0,0,1,2018-07,Sunday
2,9470290,31930241,2018-07-15 12:12:00,Rice,Rice,supermarket,64000.0,0,3,2018-07,Sunday
3,9643416,32418582,2018-07-24 08:27:00,Rice,Rice,minimarket,65000.0,0,1,2018-07,Tuesday
4,9692093,32561236,2018-07-26 11:28:00,Rice,Rice,supermarket,124500.0,0,1,2018-07,Thursday

In [53]:
household[['category','sub_category','format']]=household[['category','sub_category','format']].astype('category')
household.dtypes

receipt_id                   int64
receipts_item_id             int64
purchase_time       datetime64[ns]
category                  category
sub_category              category
format                    category
unit_price                 float64
discount                     int64
quantity                     int64
yearmonth                   object
weekday                     object
dtype: object

After looking on `household` columns' data type, select column(s) which is/are better to be stored as `category`.
1. category
2. sub_category
3. format
4. weekday
5. quantity

### Check number of unique value with `.nunique()`

In [54]:
len(household)

72000

In [55]:
# print(household['sub_category'].nunique())
print(household['sub_category'].nunique())

3

In [56]:
print(household['category'].nunique())

3

In [57]:
print(household['format'].unique())

['supermarket', 'minimarket', 'hypermarket']
Categories (3, object): ['supermarket', 'minimarket', 'hypermarket']

In [58]:
print(household['weekday'].nunique())
print(household['weekday'].unique())

7
['Sunday' 'Tuesday' 'Thursday' 'Wednesday' 'Saturday' 'Monday' 'Friday']

In [59]:
print(household['yearmonth'].nunique())

12

In [60]:
#mengetahui seluruh value unique di semua kolom
household.nunique()

receipt_id          69776
receipts_item_id    72000
purchase_time       62072
category                3
sub_category            3
format                  3
unit_price           3884
discount             1329
quantity               19
yearmonth              12
weekday                 7
dtype: int64

In [61]:
print(household['sub_category'].unique())

['Rice', 'Detergent', 'Sugar']
Categories (3, object): ['Rice', 'Detergent', 'Sugar']

### `astype()` to convert the data types into `category`

In [62]:
household['weekday']=household['purchase_time'].dt.day_name()
household['yearmonth']=household['purchase_time'].dt.to_period('M')
household.head()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth,weekday
0,9622257,32369294,2018-07-22 21:19:00,Rice,Rice,supermarket,128000.0,0,1,2018-07,Sunday
1,9446359,31885876,2018-07-15 16:17:00,Rice,Rice,minimarket,102750.0,0,1,2018-07,Sunday
2,9470290,31930241,2018-07-15 12:12:00,Rice,Rice,supermarket,64000.0,0,3,2018-07,Sunday
3,9643416,32418582,2018-07-24 08:27:00,Rice,Rice,minimarket,65000.0,0,1,2018-07,Tuesday
4,9692093,32561236,2018-07-26 11:28:00,Rice,Rice,supermarket,124500.0,0,1,2018-07,Thursday

In [63]:
household['weekday'] = household['weekday'].astype('category')
household.dtypes

receipt_id                   int64
receipts_item_id             int64
purchase_time       datetime64[ns]
category                  category
sub_category              category
format                    category
unit_price                 float64
discount                     int64
quantity                     int64
yearmonth                period[M]
weekday                   category
dtype: object

Now it is your time to try to convert the other data types into `category` (if needed)
1. convert the data into `category`
2. do not forget to assign the converted column into the column back
3. check the data type

In [64]:
# put the answer code here
household[['category','sub_category','format']]=household[['category','sub_category','format']].astype('category')
household.dtypes
household

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth,weekday
0,9622257,32369294,2018-07-22 21:19:00,Rice,Rice,supermarket,128000.0,0,1,2018-07,Sunday
1,9446359,31885876,2018-07-15 16:17:00,Rice,Rice,minimarket,102750.0,0,1,2018-07,Sunday
2,9470290,31930241,2018-07-15 12:12:00,Rice,Rice,supermarket,64000.0,0,3,2018-07,Sunday
3,9643416,32418582,2018-07-24 08:27:00,Rice,Rice,minimarket,65000.0,0,1,2018-07,Tuesday
4,9692093,32561236,2018-07-26 11:28:00,Rice,Rice,supermarket,124500.0,0,1,2018-07,Thursday
...,...,...,...,...,...,...,...,...,...,...,...
71995,5909305,17998610,2017-12-27 09:20:00,Sugar/Flavored Syrup,Sugar,minimarket,25000.0,0,1,2017-12,Wednesday
71996,5736299,17432379,2017-12-13 19:52:00,Sugar/Flavored Syrup,Sugar,minimarket,12500.0,0,1,2017-12,Wednesday
71997,5901144,18263665,2017-12-27 08:03:00,Sugar/Flavored Syrup,Sugar,minimarket,12500.0,0,1,2017-12,Wednesday
71998,5660630,17222218,2017-12-07 12:29:00,Sugar/Flavored Syrup,Sugar,hypermarket,12500.0,0,3,2017-12,Thursday
71999,5808147,17658789,2017-12-19 18:59:00,Sugar/Flavored Syrup,Sugar,minimarket,12500.0,0,3,2017-12,Tuesday

In [65]:
household.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72000 entries, 0 to 71999
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   receipt_id        72000 non-null  int64
 1   receipts_item_id  72000 non-null  int64
 2   purchase_time     72000 non-null  datetime64[ns]
 3   category          72000 non-null  category
 4   sub_category      72000 non-null  category
 5   format            72000 non-null  category
 6   unit_price        72000 non-null  float64
 7   discount          72000 non-null  int64
 8   quantity          72000 non-null  int64
 9   yearmonth         72000 non-null  period[M]
 10  weekday           72000 non-null  category
dtypes: category(4), datetime64[ns](1), float64(1), int64(4), period[M](1)
memory usage: 4.1 MB

_tips_ : you can perform multiple column subsetting with `astype()`

## Contingency Tables

One of the simplest EDA toolkit is the frequency table (contingency tables) and cross-tabulation tables. It is highly familiar, convenient, and practical for a wide array of statistical tasks. The simplest form of a table is to display counts of a `categorical` column.

In [66]:
household.head()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth,weekday
0,9622257,32369294,2018-07-22 21:19:00,Rice,Rice,supermarket,128000.0,0,1,2018-07,Sunday
1,9446359,31885876,2018-07-15 16:17:00,Rice,Rice,minimarket,102750.0,0,1,2018-07,Sunday
2,9470290,31930241,2018-07-15 12:12:00,Rice,Rice,supermarket,64000.0,0,3,2018-07,Sunday
3,9643416,32418582,2018-07-24 08:27:00,Rice,Rice,minimarket,65000.0,0,1,2018-07,Tuesday
4,9692093,32561236,2018-07-26 11:28:00,Rice,Rice,supermarket,124500.0,0,1,2018-07,Thursday

### value_counts()
Method to get the frequency of series object.

In [67]:
type(household['format'])

pandas.core.series.Series

Refrensi : https://pandas.pydata.org/docs/reference/api/pandas.Series.value_counts.html

In [68]:
household.value_counts()

receipt_id  receipts_item_id  purchase_time        category              sub_category  format       unit_price  discount  quantity  yearmonth  weekday
3072697     8904708           2017-11-04 09:34:00  Sugar/Flavored Syrup  Sugar         supermarket  12500.0     0         2         2017-11    Saturday    1
8568396     29276019          2018-05-29 07:49:00  Rice                  Rice          minimarket   62500.0     0         2         2018-05    Tuesday     1
8568759     29287172          2018-06-01 15:42:00  Sugar/Flavored Syrup  Sugar         supermarket  6000.0      0         1         2018-06    Friday      1
8568695     29295261          2018-06-01 02:02:00  Fabric Care           Detergent     minimarket   16300.0     0         1         2018-06    Friday      1
8568624     29304578          2018-06-01 17:32:00  Fabric Care           Detergent     supermarket  15900.0     0         1         2018-06    Friday      1
                                                                                                                                                          ..
6394795     19366551          2018-02-01 08:34:00  Fabric Care           Detergent     minimarket   35900.0     0         1         2018-02    Thursday    1
6394816     19491999          2018-02-01 12:14:00  Fabric Care           Detergent     minimarket   15700.0     0         1         2018-02    Thursday    1
6394886     19364653          2018-02-01 13:38:00  Rice                  Rice          minimarket   132500.0    0         1         2018-02    Thursday    1
6395059     19364032          2018-02-01 15:39:00  Fabric Care           Detergent     supermarket  24900.0     9090      1         2018-02    Thursday    1
11569055    38399658          2018-09-30 21:57:00  Fabric Care           Detergent     minimarket   5000.0      0         1         2018-09    Sunday      1
Length: 72000, dtype: int64

Try to find the frequency of `category` columns in **ascending** order

In [69]:
household['format'].value_counts(ascending=True)

hypermarket     5371
supermarket    19826
minimarket     46803
Name: format, dtype: int64

In [70]:
# put the answer code here
household['category'].value_counts(ascending=True)

Rice                    12000
Sugar/Flavored Syrup    24000
Fabric Care             36000
Name: category, dtype: int64

In [71]:
print(household['weekday'].value_counts(ascending=False))
print(household['category'].value_counts(ascending=True))

Sunday       12573
Saturday     11828
Friday       10778
Tuesday       9427
Wednesday     9206
Thursday      9138
Monday        9050
Name: weekday, dtype: int64
Rice                    12000
Sugar/Flavored Syrup    24000
Fabric Care             36000
Name: category, dtype: int64

From `value_counts()` we can slice the data to get the biggest and smallest frequency with head(1) and tail(1)

In [72]:
# to get the biggest frequency
household['sub_category'].value_counts(ascending=False).head(1)

Detergent    36000
Name: sub_category, dtype: int64

Try to find `category` with the smallest frequency in `household` data

In [73]:
# put the answer code here
household['category'].value_counts(ascending=False).tail(1)

Rice    12000
Name: category, dtype: int64

### pd.crosstab( )
crosstab is a very versatile solution to producing frequency tables on a DataFrame object. Its utility really goes further than that but we'll start with a simple use-case.

Refrensi : https://pandas.pydata.org/docs/reference/api/pandas.crosstab.html

In [74]:
pd.crosstab(index=household['sub_category'], columns="total")

col_0         total
sub_category
Detergent     36000
Rice          12000
Sugar         24000

using `sort_values( )` to sort values

In [75]:
pd.crosstab(index=household['sub_category'], columns="total").sort_values(by='total', ascending=True)

col_0         total
sub_category
Rice          12000
Sugar         24000
Detergent     36000

**Knowledge Check:** cross tab  
_Est. Time required: 10 minutes_

1. In the following cell, use pd.crosstab() with `category` as the row and "total" as the columns
2. Sort the data by the total by desdencing order
3. **challenge** get the `category` with the smallest frequency

In [76]:
# put the answer code here
pd.crosstab(index=household['category'], columns="total").sort_values(by='total', ascending=False)

col_0                 total
category
Fabric Care           36000
Sugar/Flavored Syrup  24000
Rice                  12000

In [77]:
# put the answer code here
pd.crosstab(index=household['category'], columns="total").sort_values(by='total', ascending=False).tail(1)

col_0     total
category
Rice      12000

**normalize parameter**

In [78]:
pd.crosstab(index=household['category'], columns="total", normalize=True)

col_0                    total
category
Fabric Care           0.500000
Rice                  0.166667
Sugar/Flavored Syrup  0.333333

In [79]:
pd.crosstab(index=household['sub_category'], columns="total", normalize=True)*100

col_0             total
sub_category
Detergent     50.000000
Rice          16.666667
Sugar         33.333333

When we use `normalize=True` parameter, it will show us exactly like if we did this
```
catego = pd.crosstab(index=household['sub_category'], columns="total")
catego / catego.sum()
```

In [80]:
# try the normalize parameter to know the distribution of `format` values in our data
# put the answer code here
pd.crosstab(index=household['format'], columns="total", normalize=True)*100

col_0            total
format
hypermarket   7.459722
minimarket   65.004167
supermarket  27.536111

We can also use the same `crosstab` method to compute a cross-tabulation of two factors. In the following cell, the `index` references the sub-category column while the `columns` references the format column:

In [81]:
pd.crosstab(index=household['sub_category'], columns=household['weekday'])

weekday       Friday  Monday  Saturday  Sunday  Thursday  Tuesday  Wednesday
sub_category
Detergent       5748    4337      6147    6381      4320     4522       4545
Rice            1646    1551      1915    2234      1552     1621       1481
Sugar           3384    3162      3766    3958      3266     3284       3180

In [82]:
pd.crosstab(index=household['sub_category'], columns=household['format'])

format        hypermarket  minimarket  supermarket
sub_category
Detergent            2611       24345         9044
Rice                  999        7088         3913
Sugar                1761       15370         6869

This is intuitive in a way: We use `crosstab()` which, we recall, computes the count and we pass in `index` and `columns` which correspond to the row and column respectively.

When we add `margins=True` to our method call, then an extra row and column of margins (subtotals) will be included in the output:

In [83]:
pd.crosstab(index=household['sub_category'], 
            columns=household['format'], 
            normalize='columns',
            margins=True)*100

format        hypermarket  minimarket  supermarket        All
sub_category
Detergent       48.612921   52.015896    45.616867  50.000000
Rice            18.599888   15.144328    19.736709  16.666667
Sugar           32.787190   32.839775    34.646424  33.333333

In [84]:
newtab=pd.crosstab(index=household['sub_category'], 
            columns=household['format'],
            margins=True)
newtab['Modern Channel (hypermarket+supermarket)']=newtab['hypermarket']+newtab['supermarket']
newtab.head()

format,hypermarket,minimarket,supermarket,All,Modern Channel (hypermarket+supermarket)
sub_category,,,,,
Detergent,2611,24345,9044,36000,11655
Rice,999,7088,3913,12000,4912
Sugar,1761,15370,6869,24000,8630
All,5371,46803,19826,72000,25197

### **Knowledge Check:** Congtingency Table  
_Est. Time required: 15 minutes_

1. In the following cell, use pd.crosstab() with `yearmonth` as the row and `format` as the column
2. Set `margins=True` to get a total across the columns
3. Include `normalize` to 'all'

In [85]:
# put the answer code here
newtab2=pd.crosstab(index=household['yearmonth'], 
            columns=household['format'],margins=True)
newtab2

format     hypermarket  minimarket  supermarket    All
yearmonth
2017-10            446        3898         1656   6000
2017-11            442        3912         1646   6000
2017-12            427        3939         1634   6000
2018-01            449        3960         1591   6000
2018-02            513        3745         1742   6000
2018-03            521        3540         1939   6000
2018-04            376        3909         1715   6000
2018-05            487        3704         1809   6000
2018-06            458        3949         1593   6000
2018-07            356        4293         1351   6000
2018-08            455        3994         1551   6000
2018-09            441        3960         1599   6000
All               5371       46803        19826  72000

In [86]:
newtab3=pd.crosstab(index=household['yearmonth'],normalize='columns', 
            columns=household['format'],margins=True)*100
newtab3

format     hypermarket  minimarket  supermarket       All
yearmonth
2017-10       8.303854    8.328526     8.352668  8.333333
2017-11       8.229380    8.358439     8.302229  8.333333
2017-12       7.950102    8.416127     8.241703  8.333333
2018-01       8.359710    8.460996     8.024816  8.333333
2018-02       9.551294    8.001624     8.786442  8.333333
2018-03       9.700242    7.563618     9.780087  8.333333
2018-04       7.000559    8.352029     8.650257  8.333333
2018-05       9.067213    7.914023     9.124382  8.333333
2018-06       8.527276    8.437493     8.034904  8.333333
2018-07       6.628188    9.172489     6.814284  8.333333
2018-08       8.471421    8.533641     7.823061  8.333333
2018-09       8.210761    8.460996     8.065167  8.333333

In [87]:
newtab2['%hypermarket']=newtab3['hypermarket']
newtab2['%minimarket']=newtab3['minimarket']
newtab2['%supermarket']=newtab3['supermarket']
newtab2['&All']=newtab3['All']
newtab2

format,hypermarket,minimarket,supermarket,All,%hypermarket,%minimarket,%supermarket,&All
yearmonth,,,,,,,,
2017-10,446,3898,1656,6000,8.303854,8.328526,8.352668,8.333333
2017-11,442,3912,1646,6000,8.229380,8.358439,8.302229,8.333333
2017-12,427,3939,1634,6000,7.950102,8.416127,8.241703,8.333333
2018-01,449,3960,1591,6000,8.359710,8.460996,8.024816,8.333333
2018-02,513,3745,1742,6000,9.551294,8.001624,8.786442,8.333333
2018-03,521,3540,1939,6000,9.700242,7.563618,9.780087,8.333333
2018-04,376,3909,1715,6000,7.000559,8.352029,8.650257,8.333333
2018-05,487,3704,1809,6000,9.067213,7.914023,9.124382,8.333333
2018-06,458,3949,1593,6000,8.527276,8.437493,8.034904,8.333333
2018-07,356,4293,1351,6000,6.628188,9.172489,6.814284,8.333333
2018-08,455,3994,1551,6000,8.471421,8.533641,7.823061,8.333333
2018-09,441,3960,1599,6000,8.210761,8.460996,8.065167,8.333333
All,5371,46803,19826,72000,NaN,NaN,NaN,NaN

In [88]:
newtab2=pd.crosstab(index=household['yearmonth'], 
            columns=household['format'],margins=True)
newtab3=pd.crosstab(index=household['yearmonth'],normalize='all', 
            columns=household['format'],margins=True)*100
newtab2['%hypermarket']=newtab3['hypermarket']
newtab2['%minimarket']=newtab3['minimarket']
newtab2['%supermarket']=newtab3['supermarket']
newtab2['%All']=newtab3['All']
newtab2
#newtab2.sort_values(by='yearmonth',ascending=False)

format,hypermarket,minimarket,supermarket,All,%hypermarket,%minimarket,%supermarket,%All
yearmonth,,,,,,,,
2017-10,446,3898,1656,6000,0.619444,5.413889,2.300000,8.333333
2017-11,442,3912,1646,6000,0.613889,5.433333,2.286111,8.333333
2017-12,427,3939,1634,6000,0.593056,5.470833,2.269444,8.333333
2018-01,449,3960,1591,6000,0.623611,5.500000,2.209722,8.333333
2018-02,513,3745,1742,6000,0.712500,5.201389,2.419444,8.333333
2018-03,521,3540,1939,6000,0.723611,4.916667,2.693056,8.333333
2018-04,376,3909,1715,6000,0.522222,5.429167,2.381944,8.333333
2018-05,487,3704,1809,6000,0.676389,5.144444,2.512500,8.333333
2018-06,458,3949,1593,6000,0.636111,5.484722,2.212500,8.333333
2018-07,356,4293,1351,6000,0.494444,5.962500,1.876389,8.333333
2018-08,455,3994,1551,6000,0.631944,5.547222,2.154167,8.333333
2018-09,441,3960,1599,6000,0.612500,5.500000,2.220833,8.333333
All,5371,46803,19826,72000,7.459722,65.004167,27.536111,100.000000

In [89]:
household

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth,weekday
0,9622257,32369294,2018-07-22 21:19:00,Rice,Rice,supermarket,128000.0,0,1,2018-07,Sunday
1,9446359,31885876,2018-07-15 16:17:00,Rice,Rice,minimarket,102750.0,0,1,2018-07,Sunday
2,9470290,31930241,2018-07-15 12:12:00,Rice,Rice,supermarket,64000.0,0,3,2018-07,Sunday
3,9643416,32418582,2018-07-24 08:27:00,Rice,Rice,minimarket,65000.0,0,1,2018-07,Tuesday
4,9692093,32561236,2018-07-26 11:28:00,Rice,Rice,supermarket,124500.0,0,1,2018-07,Thursday
...,...,...,...,...,...,...,...,...,...,...,...
71995,5909305,17998610,2017-12-27 09:20:00,Sugar/Flavored Syrup,Sugar,minimarket,25000.0,0,1,2017-12,Wednesday
71996,5736299,17432379,2017-12-13 19:52:00,Sugar/Flavored Syrup,Sugar,minimarket,12500.0,0,1,2017-12,Wednesday
71997,5901144,18263665,2017-12-27 08:03:00,Sugar/Flavored Syrup,Sugar,minimarket,12500.0,0,1,2017-12,Wednesday
71998,5660630,17222218,2017-12-07 12:29:00,Sugar/Flavored Syrup,Sugar,hypermarket,12500.0,0,3,2017-12,Thursday
71999,5808147,17658789,2017-12-19 18:59:00,Sugar/Flavored Syrup,Sugar,minimarket,12500.0,0,3,2017-12,Tuesday

## Aggregation Table
In the following section, we will introduce another parameter to perform aggregation on our table. The `aggfunc` parameter when present, required the `values` parameter to be specified as well. `values` is the values to aggregate according to the factors in our index and columns.

`aggfunc` = mean, median, sum, count

In [90]:
pd.crosstab(index=household['sub_category'], 
            columns='mean', 
            values=household['unit_price']*household['quantity'],
            aggfunc='mean',margins='All')

col_0                 mean           All
sub_category
Detergent     24057.452666  24057.452666
Rice          90366.554917  90366.554917
Sugar         21329.772002  21329.772002
All           34199.742820  34199.742820

In [91]:
pd.crosstab(index=household['sub_category'], 
            columns=household['format'], 
            values=household['unit_price'],
            aggfunc='median',margins=True)

format        hypermarket  minimarket  supermarket      All
sub_category
Detergent         16900.0     16800.0      16500.0  16800.0
Rice              64000.0     62900.0      64000.0  63500.0
Sugar             12250.0     12500.0      12400.0  12500.0
All               15990.0     15500.0      14907.5  15472.5

In [92]:
pd.crosstab(index=household['sub_category'], 
            columns=household['format'], 
            values=household['unit_price'],
            aggfunc='mean')

format         hypermarket    minimarket   supermarket
sub_category
Detergent     19328.141915  17757.135774  17847.557137
Rice          71205.458458  67135.569554  74921.182150
Sugar         13539.915728  12352.135470  13071.112361

In [93]:
pd.crosstab(index=household['format'], 
            columns=household['sub_category'], 
            values=household['unit_price'],
            aggfunc='median')

sub_category  Detergent     Rice    Sugar
format
hypermarket     16900.0  64000.0  12250.0
minimarket      16800.0  62900.0  12500.0
supermarket     16500.0  64000.0  12400.0

In [94]:
Salary=pd.Series([5,6,5.5,4,9,80])

In [95]:
Salary.mean()

18.25

How to know which place sells Sugar with the highest average price (with median)

In [96]:
pd.crosstab(index=household['format'], 
            columns=household['sub_category'], 
            values=household['unit_price'],
            aggfunc='median').sort_values(by='Sugar',ascending=False).iloc[[0],[2]]

sub_category    Sugar
format
minimarket    12500.0

**Knowledge Check** Agg. Table
(_Est. Time required: 30 minutes_)
1. Create a cross tab to get total `quantity` for every `category` and sort it in descending order
2. Find day in `weekday` with the highest total sales in `supermarket` with cross tab (psst: unit price != total sales)

In [97]:
#1
# put the answer code here

pd.crosstab(index=household['category'],columns='total',values=household['quantity'],aggfunc='sum').sort_values(by='total',ascending=False)

col_0                 total
category
Fabric Care           49660
Sugar/Flavored Syrup  41111
Rice                  15995

In [98]:
#2
# put the answer code here
household['total sales']=household['quantity']*household['unit_price']

In [99]:
household['total sales']=household['quantity']*household['unit_price']
pd.crosstab(index=household['weekday'], 
            columns=household['format'], 
            values=household['total sales'].round(decimals=0),
            aggfunc='sum',margins=True).sort_values(by='supermarket',ascending=False).iloc[[1],[2]]

format   supermarket
weekday
Sunday   141795396.0

#**multidimensional table**

In [100]:
pd.crosstab(
    index=household['yearmonth'],
    columns=[household['format'],household['sub_category']],
    values=household['unit_price'],
    aggfunc='median'
).head()

format       hypermarket                   minimarket                    \
sub_category   Detergent     Rice    Sugar  Detergent     Rice    Sugar
yearmonth
2017-10          17400.0  64000.0  12500.0    16800.0  62500.0  12500.0
2017-11          16770.0  64000.0  12400.0    16800.0  62500.0  12500.0
2017-12          17500.0  64000.0  12000.0    16600.0  62500.0  12500.0
2018-01          16800.0  64000.0  12275.0    16200.0  62500.0  12500.0
2018-02          17500.0  64000.0  11990.0    17000.0  63500.0  12500.0

format       supermarket
sub_category   Detergent     Rice    Sugar
yearmonth
2017-10          16925.0  64000.0  12500.0
2017-11          16500.0  64000.0  12400.0
2017-12          16600.0  64000.0  12400.0
2018-01          16700.0  64000.0  12400.0
2018-02          16200.0  64000.0  12290.0

### Pivot table

pivot_table is quite similar with crosstab, the difference in the formula is how pivot_table calls the data for `index` and `column`, it causes pivot_table to have additional `data` parameter

```
pd.pivot_table(
    data= ,
    index= ,
    columns= ,
    values= ,
    aggfunc= 
)
```

In [101]:
# cross tab
pd.crosstab(
    index=household['yearmonth'],
    columns=[household['format'],household['sub_category']],
    values=household['unit_price'],
    aggfunc='median'
).head()

format       hypermarket                   minimarket                    \
sub_category   Detergent     Rice    Sugar  Detergent     Rice    Sugar
yearmonth
2017-10          17400.0  64000.0  12500.0    16800.0  62500.0  12500.0
2017-11          16770.0  64000.0  12400.0    16800.0  62500.0  12500.0
2017-12          17500.0  64000.0  12000.0    16600.0  62500.0  12500.0
2018-01          16800.0  64000.0  12275.0    16200.0  62500.0  12500.0
2018-02          17500.0  64000.0  11990.0    17000.0  63500.0  12500.0

format       supermarket
sub_category   Detergent     Rice    Sugar
yearmonth
2017-10          16925.0  64000.0  12500.0
2017-11          16500.0  64000.0  12400.0
2017-12          16600.0  64000.0  12400.0
2018-01          16700.0  64000.0  12400.0
2018-02          16200.0  64000.0  12290.0

In [102]:
# pivot table with pd
pd.pivot_table(data=household,
               index='yearmonth',
              columns= ['format','sub_category'],
              values='unit_price',
              aggfunc='median').head()

format       hypermarket                   minimarket                    \
sub_category   Detergent     Rice    Sugar  Detergent     Rice    Sugar
yearmonth
2017-10          17400.0  64000.0  12500.0    16800.0  62500.0  12500.0
2017-11          16770.0  64000.0  12400.0    16800.0  62500.0  12500.0
2017-12          17500.0  64000.0  12000.0    16600.0  62500.0  12500.0
2018-01          16800.0  64000.0  12275.0    16200.0  62500.0  12500.0
2018-02          17500.0  64000.0  11990.0    17000.0  63500.0  12500.0

format       supermarket
sub_category   Detergent     Rice    Sugar
yearmonth
2017-10          16925.0  64000.0  12500.0
2017-11          16500.0  64000.0  12400.0
2017-12          16600.0  64000.0  12400.0
2018-01          16700.0  64000.0  12400.0
2018-02          16200.0  64000.0  12290.0

In [103]:
# pivot table directly from dataframe
household.pivot_table(index='yearmonth',
              columns= ['format','sub_category'],
              values='unit_price',
              aggfunc='median').head()

format       hypermarket                   minimarket                    \
sub_category   Detergent     Rice    Sugar  Detergent     Rice    Sugar
yearmonth
2017-10          17400.0  64000.0  12500.0    16800.0  62500.0  12500.0
2017-11          16770.0  64000.0  12400.0    16800.0  62500.0  12500.0
2017-12          17500.0  64000.0  12000.0    16600.0  62500.0  12500.0
2018-01          16800.0  64000.0  12275.0    16200.0  62500.0  12500.0
2018-02          17500.0  64000.0  11990.0    17000.0  63500.0  12500.0

format       supermarket
sub_category   Detergent     Rice    Sugar
yearmonth
2017-10          16925.0  64000.0  12500.0
2017-11          16500.0  64000.0  12400.0
2017-12          16600.0  64000.0  12400.0
2018-01          16700.0  64000.0  12400.0
2018-02          16200.0  64000.0  12290.0

**pivot_table _vs_ crosstab** 

default aggregation func. of crosstab is **count** meanwhile pivot_table is **mean**

In [104]:
pd.crosstab(
    index=household['format'],
    columns='Total'
)

col_0        Total
format
hypermarket   5371
minimarket   46803
supermarket  19826

In [105]:
pd.pivot_table(
    data=household,
    index='format',
)

,discount,quantity,receipt_id,receipts_item_id,total sales,unit_price
format,,,,,,
hypermarket,1986.583132,1.617576,7.620351e+06,2.448723e+07,40671.624280,27079.468095
minimarket,586.223148,1.452471,7.682470e+06,2.468952e+07,31973.434032,23460.177971
supermarket,1172.758499,1.518108,7.596452e+06,2.438298e+07,37702.085949,27457.145330

Can we use pivot_table as contingency table?

In [106]:
pd.pivot_table(
    data=household,
    index='format',
    aggfunc='count'
)

,category,discount,purchase_time,quantity,receipt_id,receipts_item_id,sub_category,total sales,unit_price,weekday,yearmonth
format,,,,,,,,,,,
hypermarket,5371,5371,5371,5371,5371,5371,5371,5371,5371,5371,5371
minimarket,46803,46803,46803,46803,46803,46803,46803,46803,46803,46803,46803
supermarket,19826,19826,19826,19826,19826,19826,19826,19826,19826,19826,19826

In [107]:
pd.crosstab(index=household['format'],columns='total')

col_0        total
format
hypermarket   5371
minimarket   46803
supermarket  19826

Count the average price of `Rice` across marketplace

In [108]:
household.pivot_table(index='format', 
                      columns= 'category', 
                      values='unit_price',aggfunc=['median','mean','sum'])

                 median                                        mean  \
category    Fabric Care     Rice Sugar/Flavored Syrup   Fabric Care
format
hypermarket     16900.0  64000.0              12250.0  19328.141915
minimarket      16800.0  62900.0              12500.0  17757.135774
supermarket     16500.0  64000.0              12400.0  17847.557137

                                                         sum                \
category             Rice Sugar/Flavored Syrup   Fabric Care          Rice
format
hypermarket  71205.458458         13539.915728  5.046578e+07  7.113425e+07
minimarket   67135.569554         12352.135470  4.322975e+08  4.758569e+08
supermarket  74921.182150         13071.112361  1.614133e+08  2.931666e+08


category    Sugar/Flavored Syrup
format
hypermarket         2.384379e+07
minimarket          1.898523e+08
supermarket         8.978547e+07

### Knowledge Check 
__Est. Time required: 15 minutes__

Create a pivot table to get total `quantity` for every `category` across `format` and sort it by `supermarket`

In [109]:
# put the answer code here
household.pivot_table(index='category',columns='format',values='quantity',aggfunc='sum').sort_values(by='supermarket',ascending=False)

format                hypermarket  minimarket  supermarket
category
Fabric Care                  3987       32679        12994
Sugar/Flavored Syrup         3237       25723        12151
Rice                         1464        9578         4953

## Table Summary

### 1. Contingency Table 

To know the frequency of data

In [110]:
# menggunakan value counts
household['format'].value_counts()

minimarket     46803
supermarket    19826
hypermarket     5371
Name: format, dtype: int64

In [111]:
# menggunakan crosstab
pd.crosstab(
    index=household['format'],
    columns='Total'
).sort_values(by='Total',ascending=False)

col_0        Total
format
minimarket   46803
supermarket  19826
hypermarket   5371

### 2. Aggregation Table

To know aggregated value of data

In [112]:
# menggunakan crosstab
pd.crosstab(
    index=household['format'],
    columns='Median',
    values=household['unit_price'],
    aggfunc='median'
)

col_0         Median
format
hypermarket  15990.0
minimarket   15500.0
supermarket  14907.5

In [113]:
# menggunakan pivot_table
pd.pivot_table(
    data=household,
    index='format',
    values='unit_price',
    aggfunc='median'

SyntaxError: unexpected EOF while parsing (<ipython-input-113-1f52a2931930>, line 6)

In [ ]:
pd.pivot_table(
    data=household,
    index='format',
    values='unit_price',
    aggfunc=['median','mean']

## Additional Material

### Missing Value

Missing value is a common thing with data analysis, we'll learn how to handle missing value

In [116]:
# inject NA value to household data
household = pd.read_csv("data_input/household.csv", index_col=1, parse_dates=['purchase_time'])
household.drop(['receipt_id', 'yearmonth', 'sub_category'], axis=1, inplace=True)
household['weekday'] = household['purchase_time'].dt.day_name()
household.head()

,purchase_time,category,format,unit_price,discount,quantity,weekday
receipts_item_id,,,,,,,
32369294,2018-07-22 21:19:00,Rice,supermarket,128000.0,0,1,Sunday
31885876,2018-07-15 16:17:00,Rice,minimarket,102750.0,0,1,Sunday
31930241,2018-07-15 12:12:00,Rice,supermarket,64000.0,0,3,Sunday
32418582,2018-07-24 08:27:00,Rice,minimarket,65000.0,0,1,Tuesday
32561236,2018-07-26 11:28:00,Rice,supermarket,124500.0,0,1,Thursday

In [117]:
import math
x=[i for i in range(32000000, 32000005)]
x.insert(2,32030785)

household2 = household.head(6).copy()
household2 = household2.reindex(x)
household2 = pd.concat([household2, household.head(14)])
household2.loc[31885876, "weekday"] = math.nan
household2.iloc[2:8,]

,purchase_time,category,format,unit_price,discount,quantity,weekday
receipts_item_id,,,,,,,
32030785,2018-07-17 18:05:00,Rice,minimarket,63500.0,0.0,1.0,Tuesday
32000002,NaT,NaN,NaN,NaN,NaN,NaN,NaN
32000003,NaT,NaN,NaN,NaN,NaN,NaN,NaN
32000004,NaT,NaN,NaN,NaN,NaN,NaN,NaN
32369294,2018-07-22 21:19:00,Rice,supermarket,128000.0,0.0,1.0,Sunday
31885876,2018-07-15 16:17:00,Rice,minimarket,102750.0,0.0,1.0,NaN

Check if there's missing value with `isna()`

In [119]:
print(household2.shape)
print(household2.size)

(20, 7)
140

In [ ]:
household2['weekday'].isna()

A common way of using the `.isna()` method is to combine it with the subsetting methods we've learned in previous lessons:

In [ ]:
household2.isna()

In [ ]:
household2[household2['weekday'].isna()]

In [ ]:
# see total missing value across columns
household2.isna().sum()

When we are certain that the rows with `NA`s can be safely dropped, we can use `dropna()`, optionally specifying a threshold. By default, this method drops the row if any NA value is present (`how='any'`), but it can be set to do this only when all values are NA in that row (`how='all'`).

```
    # drops row if all values are NA
    household2.dropna(how='all')
    
    # drops row if it doesn't have at least 5 non-NA values
    household2.dropna(thresh=5) 
```

In [120]:
household2

,purchase_time,category,format,unit_price,discount,quantity,weekday
receipts_item_id,,,,,,,
32000000,NaT,NaN,NaN,NaN,NaN,NaN,NaN
32000001,NaT,NaN,NaN,NaN,NaN,NaN,NaN
32030785,2018-07-17 18:05:00,Rice,minimarket,63500.0,0.0,1.0,Tuesday
32000002,NaT,NaN,NaN,NaN,NaN,NaN,NaN
32000003,NaT,NaN,NaN,NaN,NaN,NaN,NaN
32000004,NaT,NaN,NaN,NaN,NaN,NaN,NaN
32369294,2018-07-22 21:19:00,Rice,supermarket,128000.0,0.0,1.0,Sunday
31885876,2018-07-15 16:17:00,Rice,minimarket,102750.0,0.0,1.0,NaN
31930241,2018-07-15 12:12:00,Rice,supermarket,64000.0,0.0,3.0,Sunday
32418582,2018-07-24 08:27:00,Rice,minimarket,65000.0,0.0,1.0,Tuesday
32561236,2018-07-26 11:28:00,Rice,supermarket,124500.0,0.0,1.0,Thursday
32030785,2018-07-17 18:05:00,Rice,minimarket,63500.0,0.0,1.0,Tuesday
32935097,2018-07-29 18:18:00,Rice,supermarket,66500.0,0.0,1.0,Sunday
32593606,2018-07-25 12:48:00,Rice,minimarket,62500.0,0.0,1.0,Wednesday
32573843,2018-07-26 16:41:00,Rice,minimarket,62500.0,0.0,1.0,Thursday
31913062,2018-07-14 21:17:00,Rice,supermarket,64000.0,0.0,3.0,Saturday
31125365,2018-07-02 15:39:00,Rice,minimarket,112500.0,0.0,1.0,Monday
32856560,2018-07-31 05:51:00,Rice,hypermarket,77750.0,0.0,1.0,Tuesday
32552145,2018-07-26 11:43:00,Rice,minimarket,66500.0,0.0,1.0,Thursday
32369065,2018-07-23 14:22:00,Rice,minimarket,62900.0,0.0,1.0,Monday

In [ ]:
#trial dropna
household2.dropna(how='all').shape

In [ ]:
household2.dropna(thresh = 1).shape

In [ ]:
print(household2.dropna(thresh = 7).shape)
print(household2.dropna(thresh = 5).shape)
print(household2.dropna(thresh = 4).shape)
print(household2.dropna(thresh = 1).shape)# NA in 6 columns

Some common methods when working with missing values are demonstrated in the following section. We make a copy of the NA-included DataFrame, and name it `household3`:

In [121]:
household3 = household2.copy()
household3.head()

,purchase_time,category,format,unit_price,discount,quantity,weekday
receipts_item_id,,,,,,,
32000000,NaT,NaN,NaN,NaN,NaN,NaN,NaN
32000001,NaT,NaN,NaN,NaN,NaN,NaN,NaN
32030785,2018-07-17 18:05:00,Rice,minimarket,63500.0,0.0,1.0,Tuesday
32000002,NaT,NaN,NaN,NaN,NaN,NaN,NaN
32000003,NaT,NaN,NaN,NaN,NaN,NaN,NaN

In the following cell, the technique is demonstrably repetitive or even verbose. This is done to give us an idea of all the different options we can pick from. 

You may observe, for example that the two lines of code are functionally identical:
- `.fillna(0)`
- `.replace(np.nan, 0)`

In [ ]:
household2.fillna(value=0,axis=1).shape

In [ ]:
household2.fillna(value=0,axis=0)

In [122]:
import numpy as np
household3[['category', 'format','discount']] = household3[['category', 'format','discount']].fillna('Missing')
household3.unit_price = household3.unit_price.fillna(0)
household3.purchase_time = household3.fillna(method='bfill')
household3.purchase_time = pd.to_datetime(household3.purchase_time)
household3.weekday = household3.purchase_time.dt.day_name()
household3.quantity = household3.quantity.replace(np.nan, -1)

household3.head()

,purchase_time,category,format,unit_price,discount,quantity,weekday
receipts_item_id,,,,,,,
32000000,2018-07-17 18:05:00,Missing,Missing,0.0,Missing,-1.0,Tuesday
32000001,2018-07-17 18:05:00,Missing,Missing,0.0,Missing,-1.0,Tuesday
32030785,2018-07-17 18:05:00,Rice,minimarket,63500.0,0.0,1.0,Tuesday
32000002,2018-07-22 21:19:00,Missing,Missing,0.0,Missing,-1.0,Sunday
32000003,2018-07-22 21:19:00,Missing,Missing,0.0,Missing,-1.0,Sunday

### Duplicate Value

To observe for duplicates in our data, we can use `duplicate()` and combine it with the subsetting method as below:

In [ ]:
household3.duplicated(subset=['category'],keep='first')

In [ ]:
household3[household3.duplicated(subset=['category'],keep=False)]

In [ ]:
household3.duplicated(keep='last')

In [ ]:
household3.drop_duplicates()

In [ ]:
print(household3.shape)
print(household3.drop_duplicates(keep="first").shape)

**Knowledge Check:** Duplicates and Missing Value  
_Est. Time required: 20 minutes_

1. Duplicates may mean a different thing from a data point-of-view and a business analyst's point-of-view. You want to be extra careful about whether the duplicates is an intended characteristic of your data, or whether it poses a violation to the business logic. 

    - a. A medical center collects anonymized heart rate monitoring data from patients. It has duplicate observations collected across a span of 3 months
    - b. An insurance company uses machine learning to deliver dynamic pricing to its customers. Each row contains the customer's name, occupation / profession and historical health data. It has duplicate observations collected across a span of 3 months
    - c. On our original `household` data, check for duplicate observations. Would you have drop the duplicated rows?

---

2. Once you've identified the missing values, there are 3 common ways to deal with it:

    - a. Use `dropna` with a reasonable threshold to remove any rows that contain too little values rendering it unhelpful to your analysis
    - b. Replace the missing values with a central value (mean or median)
    - c. Imputation through a predictive model
        - In a dataframe where `salary` is missing but the bank has data about the customer's occupation / profession, years of experience, years of education, seniority level, age, and industry, then a machine learning model such as regression or nearest neighbor can offer a viable alternative to the mean imputation approach